package test;

public class Case_07 {

	/*
	 * 我国古代数学家张邱建在《算经》中出了一道“百钱买百鸡”的问题，题意是这样的： 
	 * 5文钱可以买一只公鸡，3文钱可以买一只母鸡，1文钱可以买3只雏鸡。
	 * 现在用100文钱买100只鸡，那么各有公鸡、母鸡、雏鸡多少只
	 */

	public static void main(String[] args) {
		int x, y, z;
		int s = 0;

		for (x = 0; x <= 20; x++) {   // 100 / 5 = 20 公鸡
			for (y = 0; y <= 33; y++) {   // 100 / 3 = 33 母鸡
	
				for (z = 0; z <= 100; z++) {  // 100 / 1 = 100雏鸡
					if ((x + y + z) == 100 && (x * 5 + y * 3 + z / 3) == 100 && (z % 3 == 0)) {        // 100 % 3 =0 //同时匹配
						s++;
						System.out.println("第" + s + "种方法：" + x + "只公鸡" + y + "只母鸡" + z + "只雏鸡");
					}
				}
				
				
				
				
			}
		}

	}

}
